import os
import logging
import onnxruntime as ort

ort.set_default_logger_severity(3)

logging.getLogger("airtest").setLevel(logging.ERROR)
logging.getLogger("ppocr").setLevel(logging.ERROR)
logging.getLogger("ddddocr").setLevel(logging.ERROR)


DEFAULT_SLEEP_TIME = 0.5
ROOT_DIR = os.path.dirname(os.path.dirname(os.path.abspath(__file__)))


"""
# 第一个回合是0
round_dic = {
    "新手級7月前半": 12, "新手級7月后半": 13, "新手級8月前半": 14, "新手級8月后半": 15, "新手級9月前半": 16, "新手級9月后半": 17,
    "新手級10月前半": 18, "新手級10月后半": 19, "新手級11月前半": 20, "新手級11月后半": 21, "新手級12月前半": 22, "新手級12月后半": 23,

    "經典級1月前半": 24, "經典級1月后半": 25, "經典級2月前半": 26, "經典級2月后半": 27, "經典級3月前半": 28, "經典級3月后半": 29,
    "經典級4月前半": 30, "經典級4月后半": 31, "經典級5月前半": 32, "經典級5月后半": 33, "經典級6月前半": 34, "經典級6月后半": 35,
    "經典級7月前半": 36, "經典級7月后半": 37, "經典級8月前半": 38, "經典級8月后半": 39, "經典級9月前半": 40, "經典級9月后半": 41,
    "經典級10月前半": 42, "經典級10月后半": 43, "經典級11月前半": 44, "經典級11月后半": 45, "經典級12月前半": 46, "經典級12月后半": 47,

    "資深級1月前半": 48, "資深級1月后半": 49, "資深級2月前半": 50, "資深級2月后半": 51, "資深級3月前半": 52, "資深級3月后半": 53,
    "資深級4月前半": 54, "資深級4月后半": 55, "資深級5月前半": 56, "資深級5月后半": 57, "資深級6月前半": 58, "資深級6月后半": 59,
    "資深級7月前半": 60, "資深級7月后半": 61, "資深級8月前半": 62, "資深級8月后半": 63, "資深級9月前半": 64, "資深級9月后半": 65,
    "資深級10月前半": 66, "資深級10月后半": 67, "資深級11月前半": 68, "資深級11月后半": 69, "資深級12月前半": 70, "資深級12月后半": 71,
}
"""