"""
schedule 值的含义
0：不打比赛，训练
1：马娘自带的赛程
2：需要达成目标而设定的赛程，比如说小栗帽的2次G1
3：额外设定的赛程，比如巅峰杯63战63胜
4：Ura
"""
data = {
    "target_scenario": "ura",
    "uma_name": "oguri_cap",
    "uma_chinese_name": "小栗帽",
    "parent_uma_rank_1": 10,
    "parent_uma_rank_2": 6,
    "parent_uma_rank_friend": 3,
    "support_card_png_name": "200px-Support_thumb_30078.png",
    "train_benefit": [20, 0, 10, 0, 0],
    "train_target": [800, 600, 600, 200, 200],
    "add_skill_list": ["貪吃鬼", "圓弧的藝術家", "曲線的侍酒師"],
    "add_skill_running_style": "前列",
    "add_skill_running_distance": "中距離",
    "schedule": {
        1: 0, 2: 0, 3: 0, 4: 0, 5: 0, 6: 0, 7: 0, 8: 0, 9: 0, 10: 0, 11: 0, 12: 1,
        13: 0, 14: 0, 15: 0, 16: 0, 17: 0, 18: 0, 19: 0, 20: 0, 21: 0, 22: 0, 23: 3, 24: 3,
        25: 0, 26: 0, 27: 0, 28: 0, 29: 0, 30: 0, 31: 3, 32: 0, 33: 1, 34: 3, 35: 0, 36: 3,
        37: 0, 38: 0, 39: 0, 40: 0, 41: 0, 42: 0, 43: 0, 44: 3, 45: 3, 46: 1, 47: 0, 48: 1,
        49: 0, 50: 0, 51: 0, 52: 0, 53: 0, 54: 0, 55: 0, 56: 0, 57: 3, 58: 0, 59: 0, 60: 2,
        61: 0, 62: 0, 63: 0, 64: 0, 65: 0, 66: 0, 67: 0, 68: 1, 69: 0, 70: 3, 71: 0, 72: 1,
        73: 0, 74: 4, 75: 0, 76: 4, 77: 0, 78: 4, 2674: 0
    },
    "daily_legend_competition_oppenent_uma": "qytk"
}
