"""
schedule 值的含义
0：不打比赛，训练
1：马娘自带的赛程
2：需要达成目标而设定的赛程，比如说小栗帽的2次G1
3：额外设定的赛程，比如巅峰杯63战63胜
4：Ura
"""
data = {
    "target_scenario": "ura",
    "uma_name": "vodka",
    "uma_chinese_name": "伏特加",
    "parent_uma_rank_1": 2,
    "parent_uma_rank_2": 3,
    "parent_uma_rank_friend": 2,
    "support_card_png_name": "200px-Support_thumb_30016.png",
    "train_benefit": [20, 0, 10, 0, 0],
    "train_target": [800, 400, 600, 200, 800],
    "add_skill_list": [],
    "add_skill_running_style": "領頭",
    "add_skill_running_distance": "短距離",
    "schedule": {
        1: 0, 2: 0, 3: 0, 4: 0, 5: 0, 6: 0, 7: 0, 8: 0, 9: 0, 10: 0, 11: 0, 12: 1,
        13: 0, 14: 0, 15: 0, 16: 0, 17: 0, 18: 0, 19: 0, 20: 0, 21: 0, 22: 0, 23: 0, 24: 0,
        25: 0, 26: 0, 27: 0, 28: 0, 29: 3, 30: 0, 31: 3, 32: 0, 33: 3, 34: 0, 35: 3, 36: 0,
        37: 0, 38: 0, 39: 0, 40: 0, 41: 0, 42: 3, 43: 0, 44: 0, 45: 0, 46: 0, 47: 0, 48: 0,
        49: 0, 50: 0, 51: 0, 52: 0, 53: 0, 54: 3, 55: 0, 56: 0, 57: 0, 58: 0, 59: 0, 60: 0,
        61: 0, 62: 0, 63: 0, 64: 0, 65: 0, 66: 3, 67: 0, 68: 0, 69: 0, 70: 3, 71: 0, 72: 0,
        73: 0, 74: 4, 75: 0, 76: 4, 77: 0, 78: 4, 2674: 0
    },
    "daily_legend_competition_opponent_uma": "qytk"
}
